list=["北京","上海","广东","重庆","河北","山西","辽宁","吉林",
      "黑龙江","江苏","浙江","安徽省","福建","江西","山东","河南",
      "湖北","湖南","广东","海南","四川","贵州","云南","陕西",
      "甘肃","青海","台湾","内蒙古","广西","西藏","宁夏","新疆"]
i=list[1]
list[1]=list[2]
list[2]=i
print(list)

# for a,b in enumerate(list):
#     if a==1:
#         b=list[2]
#     if a ==2:
#         b=list[1]
#     print(a,b)
list=[36710.36,35427.10,29863.23,29667.39,27665.36,27650.45,27620.38,25369.20]
i=list[0]+list[2]+list[3]+list[4]+list[5]+list[6]+list[7]
j=i/8
print("GDP总和=",i)
print("平均GDP=",j)
